{"keras_version": "1.1.2", "config": [{"config": {"input_dtype": "float32", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0013model-mini-batch.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "output_shape": [128, 256, 3], "trainable": true, "batch_input_shape": [null, 128, 256, 3]}, "class_name": "Lambda"}, {"config": {"nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_1", "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 24, "border_mode": "same", "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "normal", "b_constraint": null, "subsample": [1, 1], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_2", "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 36, "border_mode": "same", "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_3", "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 48, "border_mode": "same", "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_4", "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 64, "border_mode": "same", "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 100, "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"name": "dense_2", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 50, "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"name": "dense_3", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"name": "dense_4", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 1, "W_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}