{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "output_shape": [160, 320, 3], "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>O\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "normal", "name": "convolution2d_1", "trainable": true, "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "nb_row": 5, "b_regularizer": null, "nb_filter": 24, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "nb_row": 5, "b_regularizer": null, "nb_filter": 36, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "nb_row": 5, "b_regularizer": null, "nb_filter": 48, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "trainable": true, "nb_col": 5, "subsample": [1, 1], "W_constraint": null, "nb_row": 5, "b_regularizer": null, "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "trainable": true, "name": "dense_1", "W_constraint": null, "b_constraint": null, "input_dim": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "trainable": true, "name": "dense_2", "W_constraint": null, "b_constraint": null, "input_dim": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "trainable": true, "name": "dense_3", "W_constraint": null, "b_constraint": null, "input_dim": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "trainable": true, "name": "dense_4", "W_constraint": null, "b_constraint": null, "input_dim": null}}]}