{"keras_version": "1.1.2", "config": [{"config": {"input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 128, 256, 3], "trainable": true, "output_shape": [128, 256, 3], "arguments": {}, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0013model-mini-batch.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "bias": true, "nb_filter": 24, "dim_ordering": "tf", "border_mode": "same", "nb_row": 5, "b_constraint": null, "trainable": true, "activation": "linear", "init": "normal", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "bias": true, "nb_filter": 36, "dim_ordering": "tf", "border_mode": "same", "nb_row": 5, "b_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "bias": true, "nb_filter": 48, "dim_ordering": "tf", "border_mode": "same", "nb_row": 5, "b_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "bias": true, "nb_filter": 64, "dim_ordering": "tf", "border_mode": "same", "nb_row": 5, "b_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_4", "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "name": "dense_1", "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "name": "dense_2", "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "name": "dense_3", "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "name": "dense_4", "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}