{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>R\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "input_dtype": "float32", "arguments": {}, "batch_input_shape": [null, 128, 256, 3], "output_shape": [128, 256, 3], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "b_constraint": null, "nb_filter": 24, "name": "convolution2d_1", "init": "normal", "bias": true, "border_mode": "same", "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "b_constraint": null, "nb_filter": 36, "name": "convolution2d_2", "init": "glorot_uniform", "bias": true, "border_mode": "same", "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "b_constraint": null, "nb_filter": 48, "name": "convolution2d_3", "init": "glorot_uniform", "bias": true, "border_mode": "same", "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "b_constraint": null, "nb_filter": 64, "name": "convolution2d_4", "init": "glorot_uniform", "bias": true, "border_mode": "same", "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "b_constraint": null, "name": "dense_3", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "b_constraint": null, "name": "dense_4", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "activation": "linear", "input_dim": null, "W_regularizer": null}}], "keras_version": "1.1.2"}